from llmbasic import gpt4_0125_preview
import storycrete
 

storycrete.storycreate(
{
    "story_id":'场1',
    "story_content":'发现死者',
    "juese":['死者'],
    "story_list":[],
    "mid_yuansulist":[{
        "编号":"005","类型":"道具","作用":"被死者拥有物品，会在第三幕时传承给主角，表达死者与主角之间的羁绊，同时要表达死者与主角的共有的性格。例如口红，一开始死者喜欢用口红，最后主角也开始使用了","值":""
    }
,    {
        "编号":"021","类型":"道具","作用":"道具，映射主角与反派之间的关系或对决状态。","值":""
    }
    , {
        "编号":"032","类型":"道具","作用":"凶器，意指真正杀死死者的凶器，不能直接提示，带过即可。","值":""
    },
     {
        "编号":"060","类型":"线索","作用":"此处出现，间接的发现死者。埋下伏笔，不要直接提示是线索。后面场次会继续引导。可以是一个人。","值":""
    }
    
    ],
    "small_yuansulist":[
        {"类型":"背景","作用":"突出非真正致命的手法，需要把非致命的手法的元素都展现，仅是展现不要有过多的描述。真正的手法要在第三幕才开始揭露。 ","值":""}
        ,{"类型":"特写","作用":"通过特写来代表死者人物性格特征 ","值":""}
        ,{"类型":"镜头","作用":"通过镜头交代死者身份地位","值":""}
        ,{"类型":"背景","作用":"通过背景展示与作案手法相关的元素","值":""}
        
    ] 
})
 