from llmbasic import gpt4_0125_preview
import storycrete
 

storycrete.storycreate(
{
    "story_id":'场2',
    "story_content":'案发后对主角造成的影响，及铺垫下一场戏，请设计一个合理的场景准备将多个角色汇集在一起。',
    "juese":['主角'],
    "story_list":['支线_8'],
    "mid_yuansulist":[{
        "编号":"022","类型":"人物","作用":"主角的性格弱点，需要可以被反派利用，比如是具有同情心，辅助铺垫支线_8。需要通过某件事情体现出来而不是直接说出","值":"同情心"
    },
     {
        "编号":"066","类型":"线索","作用":"主角被抓到的把柄证据铺垫，不要直接说明，隐藏在环境中即可。","值":""
    }
    
    ],
    "small_yuansulist":[
        { "类型":"背景","作用":"展示代表主角此刻心境的道具。","值":""}
        ,{"类型":"背景","作用":"暗示主角在案件中的漏洞，不要直接说出来，可以是某个动作或者某件物品","值":""}
    ] 
})
 