from llmbasic import gpt4_0125_preview
import storycrete
 

storycrete.storycreate(
{
    "story_id":'场3',
    "story_content":'小部分人聚集，这场戏主要是表达大家的人际关系以及对主角的看法，通过大量对话台词与动作来形成这一点。请注意并不是简单的对话、讨论，而是带有剧情的，包括支线内容。警察不是主导。',
    "juese":['主角','侦探','配角1','配角2','配角4'],
    "story_list":['支线_5', '支线_7'],
    "mid_yuansulist":[{
        "编号":"001","类型":"台词","作用":"能够使主角与配角1-5形成反差的一句话。通过不同角色说出这个台词所衍生出的不同行为，来展示主角与其他角色在地位或行为上的不同。","值":""
    },
    #  {
    #     "编号":"031","类型":"人物","作用":"指定元素：共鸣。此处使主人公与配角4产生共鸣，进而辅助支线_5的发展","值":""
    # },
    { "编号":"022","类型":"人物","作用":"配角4也要有这个特质，并用在他身上。进而与主角获得共鸣,并辅助支线_5。但不要在剧本中直接使用这个值。","值":"同情心"
    },
    {"编号":"037","类型":"人物","作用":"配角4的专属元素，辅助人物塑造且联动060号元素，间接性联动定凶相关线索","值":""
    },
    {"编号":"040","类型":"人物","作用":"配角1专属元素，单纯人物塑造，辅助人物性格修饰的，是以塑造人物为主，但是表现形式可以是道具、性格、台词、行为等例如粉色的衣服、抖腿、说谎会吐等","值":""
    },
    {"编号":"068","类型":"线索","作用":"锁定凶线的索之一，此处出现辅助001号元素，可以是物品、事件、行为","值":""
    },
    {"编号":"069","类型":"线索","作用":"联动066号元素，场2中说到主角的弱点，就是通过这个元素间接性体现的","值":""
    }
    ],
    "small_yuansulist":["001号元素要主角、配角都通过不同语气说出来过。通过不同角色说出这个台词所衍生出的不同行为，来展示主角与其他角色在地位或行为上的不同。每个人说的台词内容不要完全一致，大致相同即可"] 
})
 